experiments/results/logs/periodic-hybrid-009/wrk2.txt
Running 10m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 5514.091ms, rate sampling interval: 16146ms
  Thread calibration: mean lat.: 5560.397ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 5633.693ms, rate sampling interval: 16334ms
  Thread calibration: mean lat.: 5684.069ms, rate sampling interval: 16146ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.70m     1.62m    6.74m    66.76%
    Req/Sec     8.55      5.76    31.00     92.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.09m 
 75.000%    5.06m 
 90.000%    5.65m 
 99.000%    6.35m 
 99.900%    6.54m 
 99.990%    6.64m 
 99.999%    6.74m 
100.000%    6.74m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8667.135     0.000000            1         1.00
   91291.647     0.100000         2124         1.11
  128516.095     0.200000         4254         1.25
  150994.943     0.300000         6381         1.43
  192282.623     0.400000         8500         1.67
  245628.927     0.500000        10620         2.00
  260177.919     0.550000        11683         2.22
  271843.327     0.600000        12747         2.50
  282591.231     0.650000        13809         2.86
  293339.135     0.700000        14895         3.33
  303562.751     0.750000        15950         4.00
  308281.343     0.775000        16461         4.44
  313524.223     0.800000        16995         5.00
  319029.247     0.825000        17541         5.71
  324796.415     0.850000        18068         6.67
  331612.159     0.875000        18603         8.00
  335282.175     0.887500        18859         8.89
  339214.335     0.900000        19118        10.00
  343670.783     0.912500        19383        11.43
  348389.375     0.925000        19648        13.33
  353632.255     0.937500        19924        16.00
  356253.695     0.943750        20052        17.78
  359137.279     0.950000        20184        20.00
  362020.863     0.956250        20315        22.86
  364904.447     0.962500        20452        26.67
  368312.319     0.968750        20594        32.00
  369885.183     0.971875        20646        35.56
  371458.047     0.975000        20715        40.00
  373293.055     0.978125        20781        45.71
  375128.063     0.981250        20851        53.33
  376963.071     0.984375        20912        64.00
  378273.791     0.985938        20948        71.11
  379060.223     0.987500        20977        80.00
  380108.799     0.989062        21008        91.43
  381419.519     0.990625        21047       106.67
  382730.239     0.992188        21082       128.00
  383516.671     0.992969        21092       142.22
  384565.247     0.993750        21117       160.00
  385351.679     0.994531        21130       182.86
  386138.111     0.995313        21142       213.33
  387186.687     0.996094        21160       256.00
  387448.831     0.996484        21168       284.44
  387973.119     0.996875        21174       320.00
  388497.407     0.997266        21182       365.71
  389283.839     0.997656        21191       426.67
  390332.415     0.998047        21202       512.00
  390594.559     0.998242        21205       568.89
  391380.991     0.998437        21208       640.00
  391643.135     0.998633        21214       731.43
  392429.567     0.998828        21217       853.33
  392691.711     0.999023        21220      1024.00
  393215.999     0.999121        21224      1137.78
  393215.999     0.999219        21224      1280.00
  393740.287     0.999316        21226      1462.86
  394264.575     0.999414        21228      1706.67
  395051.007     0.999512        21230      2048.00
  395313.151     0.999561        21231      2275.56
  395575.295     0.999609        21233      2560.00
  395575.295     0.999658        21233      2925.71
  395837.439     0.999707        21235      3413.33
  395837.439     0.999756        21235      4096.00
  397672.447     0.999780        21236      4551.11
  397672.447     0.999805        21236      5120.00
  398196.735     0.999829        21237      5851.43
  398196.735     0.999854        21237      6826.67
  398458.879     0.999878        21238      8192.00
  398458.879     0.999890        21238      9102.22
  398458.879     0.999902        21238     10240.00
  401604.607     0.999915        21239     11702.86
  401604.607     0.999927        21239     13653.33
  401604.607     0.999939        21239     16384.00
  401604.607     0.999945        21239     18204.44
  401604.607     0.999951        21239     20480.00
  404488.191     0.999957        21240     23405.71
  404488.191     1.000000        21240          inf
#[Mean    =   222132.124, StdDeviation   =    97223.378]
#[Max     =   404226.048, Total count    =        21240]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21457 requests in 10.00m, 194.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 12225
  Non-2xx or 3xx responses: 4879
Requests/sec:     35.76
Transfer/sec:    332.56KB